-- phpMyAdmin SQL Dump
-- version 5.1.2
-- https://www.phpmyadmin.net/
--
-- 主機： localhost:3306
-- 產生時間： 2023-05-12 17:19:01
-- 伺服器版本： 5.7.24
-- PHP 版本： 8.0.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `mfee_36_group_4_product`
--

-- --------------------------------------------------------

--
-- 資料表結構 `equipment_color`
--

CREATE TABLE `equipment_color` (
  `sid` int(19) NOT NULL,
  `color_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `equipment_color`
--

INSERT INTO `equipment_color` (`sid`, `color_name`) VALUES
(1, '黑'),
(2, '粉紅'),
(3, '淺藍'),
(4, '黃'),
(5, '綠');

-- --------------------------------------------------------

--
-- 資料表結構 `equipment_detail`
--

CREATE TABLE `equipment_detail` (
  `sid` int(11) NOT NULL,
  `equipment_id` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `stocks` int(19) NOT NULL,
  `picture` varchar(255) NOT NULL,
  `created_at` datetime NOT NULL,
  `color_id` int(19) NOT NULL,
  `size_id` int(19) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `equipment_detail`
--

INSERT INTO `equipment_detail` (`sid`, `equipment_id`, `price`, `stocks`, `picture`, `created_at`, `color_id`, `size_id`) VALUES
(1, 1, 349, 100, 'xxx.jpg', '2023-05-11 17:17:42', 5, 5),
(2, 2, 999, 100, 'xxx.jpg', '2023-05-11 17:17:42', 1, 7);

-- --------------------------------------------------------

--
-- 資料表結構 `equipment_name`
--

CREATE TABLE `equipment_name` (
  `sid` int(19) NOT NULL,
  `equipment_name` varchar(255) NOT NULL,
  `description` varchar(255) NOT NULL,
  `category_id` int(19) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `equipment_name`
--

INSERT INTO `equipment_name` (`sid`, `equipment_name`, `description`, `category_id`) VALUES
(1, '六角啞鈴', '框架100%Iron外殼80%乾式丁苯橡膠,20%橡膠-順丁橡膠（BR）\r\n\r\n', 10),
(2, '壺鈴', '框架100% Iron保護套 80%乾天然橡膠,20%橡膠-異戊二烯橡膠（IR）彈力帶100%橡膠-乙烯丙烯橡膠（EPDM）', 12),
(4, '可鎖式引體向上單桿', '主要布料 100% 聚酯纖維', 10),
(5, '女款初階健身短褲', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(6, '男款中階健身長褲', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(7, '重訓拉力帶', '主要布料100%聚酯纖維', 10),
(8, '女款中階健身短袖上衣', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(9, '乳清蛋白', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(10, '重訓手套', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(11, '橡膠槓片', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(12, '搖搖杯', '主要布料100%聚酯纖維', 10),
(13, '訓練彈力帶', '主要布料 100% 聚酯纖維', 10),
(14, '速度跳繩', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(15, '訓練彈力帶', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(16, '可鎖式引體向上單桿', '主要布料100%聚酯纖維', 10),
(17, '速度跳繩', '主要布料 100% 聚酯纖維', 10),
(18, '訓練彈力帶', '主要布料100%聚酯纖維', 10),
(19, '六角啞鈴', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(20, '健身運動毛巾', '主要布料100%聚酯纖維', 10),
(21, '槓片鎖', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(22, '握力器', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(23, '橡膠槓片', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(24, '門扣彈力帶', '主要布料 100% 聚酯纖維', 10),
(25, '橡膠槓片 ', '主要布料 100% 聚酯纖維', 10),
(26, '壺鈴', '主要布料100%聚酯纖維', 10),
(27, '可鎖式引體向上單桿', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(28, '訓練彈力帶', '主要布料100%聚酯纖維', 10),
(29, '健身運動毛巾', '主要布料100%聚酯纖維', 10),
(30, '可鎖式引體向上單桿', '主要布料100%聚酯纖維', 10),
(31, '乳清蛋白', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(32, '六角啞鈴', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(33, '男款中階透氣健身長褲', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(34, '懸吊式訓練器', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(35, '女款初階健身短褲', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(36, '乳清蛋白', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(37, '重訓啞鈴組', '主要布料 100% 聚酯纖維', 10),
(38, '訓練彈力帶', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(39, '翹臀圈', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(40, '重訓手套', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(41, '六角啞鈴', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(42, '重訓啞鈴組', '主要布料 100% 聚酯纖維', 10),
(43, '槓片鎖', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(44, '可鎖式引體向上單桿', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(45, '訓練彈力帶', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(46, '男款初階健身長褲', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(47, '男款初階健身長褲', '主要布料 100% 聚酯纖維', 10),
(48, '速度跳繩', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(49, '女款中階健身短袖上衣', '主要布料100%聚酯纖維', 10),
(50, '訓練彈力帶', '主要布料 100% 聚酯纖維', 10),
(51, '伏地挺身握把', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(52, '訓練彈力帶', '主要布料 100% 聚酯纖維', 10),
(53, '可鎖式引體向上單桿', '主要布料 100% 聚酯纖維', 10),
(54, '可調式握力器', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(55, '壺鈴', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(56, '訓練彈力帶', '主要布料 100% 聚酯纖維', 10),
(57, '男款中階透氣健身長褲', '主要布料100%聚酯纖維', 10),
(58, '速度跳繩', '主要布料 100% 聚酯纖維', 10),
(59, '可鎖式引體向上單桿', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(60, '小型彈力帶', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(61, '門扣彈力帶', '主要布料100%聚酯纖維', 10),
(62, '男款初階健身短袖上衣', '主要布料 100% 聚酯纖維', 10),
(63, '門扣彈力帶', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(64, '硬式深層按摩球', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(65, '壺鈴', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(66, '健腹輪 AB Wheel', '主要布料100%聚酯纖維', 10),
(67, '訓練彈力帶', '主要布料 100% 聚酯纖維', 10),
(68, '按摩球', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(69, '訓練彈力帶', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(70, '可調式彈力帶健腹輪', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(71, '乳清蛋白', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(72, '可調式握力器', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(73, '小型彈力帶', '主要布料100%聚酯纖維', 10),
(74, '男款健身背心', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(75, '速度跳繩', '主要布料100%聚酯纖維', 10),
(76, '訓練彈力帶', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(77, '訓練彈力帶', '主要布料 100% 聚酯纖維', 10),
(78, '訓練彈力帶', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(79, '訓練彈力帶', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(80, '訓練彈力帶', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(81, '男款初階健身短袖上衣', '主要布料100%聚酯纖維', 10),
(82, '重訓手套', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(83, '速度跳繩', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(84, '訓練彈力帶', '主要布料100%聚酯纖維', 10),
(85, '重訓手套', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(86, '硬式深層按摩球', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(87, '訓練彈力帶', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(88, '支鏈胺基酸粉', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(89, '可鎖式引體向上單桿', '主要布料100%聚酯纖維', 10),
(90, '橡膠槓片', '主要布料100%聚酯纖維', 10),
(91, '重訓啞鈴組', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(92, '訓練彈力帶', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(93, '重量訓練手腕綁帶', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(94, '可調式彈力帶健腹輪', '主要布料 100% 聚酯纖維', 10),
(95, '女款中階健身短袖上衣', '主要布料100%聚酯纖維', 10),
(96, '健腹輪 AB Wheel', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(97, '翹臀圈', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(98, '男款中階透氣健身長褲', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(99, '訓練彈力帶', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(100, '可調式彈力帶健腹輪', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(101, '訓練彈力帶', '主要布料100%聚酯纖維', 10),
(102, '壺鈴', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(103, '乳清蛋白', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(104, '懸吊式訓練器', '主要布料 100% 聚酯纖維', 10),
(105, '女款中階健身短袖上衣', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(106, '握力器', '主要布料100%聚酯纖維', 10),
(107, '可調式彈力帶健腹輪', '主要布料100%聚酯纖維', 10),
(108, '硬式深層按摩球', '主要布料100%聚酯纖維', 10),
(109, '握力器', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(110, '男款初階健身短袖上衣', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(111, '小型彈力帶', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(112, '男款中階健身長褲', '主要布料 100% 聚酯纖維', 10),
(113, '可調式握力器', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(114, '健身運動毛巾', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(115, '握力器', '主要布料 100% 聚酯纖維', 10),
(116, '訓練彈力帶', '主要布料100%聚酯纖維', 10),
(117, '可鎖式引體向上單桿', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(118, '門扣彈力帶', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(119, '可調式握力器', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(120, '訓練彈力帶', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(121, '可調式彈力帶健腹輪', '主要布料100%聚酯纖維', 10),
(122, '重訓手套', '主要布料100%聚酯纖維', 10),
(123, '健身運動毛巾', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(124, '門扣彈力帶', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(125, '握力器', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(126, '重訓手套', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(127, '可鎖式引體向上單桿', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(128, '橡膠槓片 ', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(129, '六角啞鈴', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(130, '按摩球', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(131, '小型彈力帶', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(132, '可鎖式引體向上單桿', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(133, '重訓手套', '主要布料 100% 聚酯纖維', 10),
(134, '乳清蛋白', '主要布料100%聚酯纖維', 10),
(135, '訓練彈力帶', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(136, '伏地挺身握把', '主要布料100%聚酯纖維', 10),
(137, '健身運動毛巾', '主要布料100%聚酯纖維', 10),
(138, '訓練彈力帶', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(139, '速度跳繩', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(140, '男款健身背心', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(141, '健腹輪 AB Wheel', '主要布料 100% 聚酯纖維', 10),
(142, '男款健身背心', '主要布料 100% 聚酯纖維', 10),
(143, '男款中階健身長褲', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(144, '男款中階健身長褲', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(145, '支鏈胺基酸粉', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(146, '訓練彈力帶', '主要布料 100% 聚酯纖維', 10),
(147, '女款中階健身短袖上衣', '主要布料100%聚酯纖維', 10),
(148, '重訓拉力帶', '主要布料 100% 聚酯纖維', 10),
(149, '男款中階健身長褲', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(150, '搖搖杯', '主要布料100%聚酯纖維', 10),
(151, '訓練彈力帶', '主要布料100%聚酯纖維', 10),
(152, '可鎖式引體向上單桿', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(153, '速度跳繩', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(154, '訓練彈力帶', '主要布料100%聚酯纖維', 10),
(155, '訓練彈力帶', '主要布料100%聚酯纖維', 10),
(156, '男款健身背心', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(157, '訓練彈力帶', '主要布料100%聚酯纖維', 10),
(158, '女款初階健身短褲', '主要布料100%聚酯纖維', 10),
(159, '可鎖式引體向上單桿', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(160, '六角啞鈴', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(161, '男款中階健身長褲', '主要布料100%聚酯纖維', 10),
(162, '可調式彈力帶健腹輪', '主要布料 100% 聚酯纖維', 10),
(163, '懸吊式訓練器', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(164, '伏地挺身握把', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(165, '健腹輪 AB Wheel', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(166, '重訓手套', '主要布料100%聚酯纖維', 10),
(167, '門扣彈力帶', '主要布料100%聚酯纖維', 10),
(168, '小型彈力帶', '主要布料 100% 聚酯纖維', 10),
(169, '握力器', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(170, '懸吊式訓練器', '主要布料 100% 聚酯纖維', 10),
(171, '女款初階健身短褲', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(172, '男款初階健身長褲', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(173, '重訓手套', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(174, '硬式深層按摩球', '主要布料100%聚酯纖維', 10),
(175, '門扣彈力帶', '主要布料100%聚酯纖維', 10),
(176, '男款中階健身長褲', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(177, '握力器', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 10),
(178, '壺鈴', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(179, '男款中階健身長褲', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(180, '壺鈴', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(181, '訓練彈力帶', '主要布料 100% 聚酯纖維', 10),
(182, '重訓拉力帶', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(183, '可鎖式引體向上單桿', '主要布料 100% 聚酯纖維', 10),
(184, '可鎖式引體向上單桿', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(185, '健腹輪 AB Wheel', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(186, '重訓啞鈴組', '主要布料 100% 聚酯纖維', 10),
(187, '健腹輪 AB Wheel', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(188, '訓練彈力帶', '主要布料100%聚酯纖維', 10),
(189, '握力器', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(190, '女款中階健身短袖上衣', '主要布料 100% 聚酯纖維 背部布料 100% 聚酯纖維', 10),
(191, '女款中階健身短袖上衣', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(192, '訓練彈力帶', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(193, '訓練彈力帶', '主要布料100%聚酯纖維', 10),
(194, '重量訓練手腕綁帶', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(195, '伏地挺身握把', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 10),
(196, '重訓拉力帶', '主要布料 100% 聚酯纖維', 10),
(197, '男款中階健身長褲', '主要布料100%聚酯纖維', 10),
(198, '可調式彈力帶健腹輪', '主要布料100%聚酯纖維', 10),
(199, '硬式深層按摩球', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(200, '可調式握力器', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 10),
(201, '訓練彈力帶', '主要布料100%聚酯纖維', 10),
(202, '乳清蛋白', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 10),
(203, '訓練彈力帶', '主要布料100%聚酯纖維', 10);

-- --------------------------------------------------------

--
-- 資料表結構 `equipment_size`
--

CREATE TABLE `equipment_size` (
  `sid` int(19) NOT NULL,
  `size` varchar(255) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `equipment_size`
--

INSERT INTO `equipment_size` (`sid`, `size`) VALUES
(1, '0.5kg'),
(2, '1kg'),
(3, '1.5kg'),
(4, '2kg'),
(5, '2.5kg'),
(6, '5kg'),
(7, '10kg'),
(8, '15kg'),
(9, '20kg'),
(10, '25kg');

-- --------------------------------------------------------

--
-- 資料表結構 `product_categories`
--

CREATE TABLE `product_categories` (
  `sid` int(19) NOT NULL,
  `categories_name` varchar(255) NOT NULL,
  `parent_sid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `product_categories`
--

INSERT INTO `product_categories` (`sid`, `categories_name`, `parent_sid`) VALUES
(1, '運動衣物', 0),
(2, '健身用品', 0),
(3, '食品', 0),
(4, '上衣', 1),
(5, '外套', 1),
(6, '下身', 1),
(8, '鞋類', 1),
(10, '啞鈴', 2),
(11, '槓鈴', 2),
(12, '壺鈴', 2);

-- --------------------------------------------------------

--
-- 資料表結構 `product_color`
--

CREATE TABLE `product_color` (
  `sid` int(19) NOT NULL,
  `color_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `product_color`
--

INSERT INTO `product_color` (`sid`, `color_name`) VALUES
(4, '橘'),
(9, '深藍'),
(2, '白'),
(3, '紅'),
(8, '紫'),
(6, '綠'),
(7, '藍'),
(5, '黃'),
(1, '黑');

-- --------------------------------------------------------

--
-- 資料表結構 `product_detail`
--

CREATE TABLE `product_detail` (
  `sid` int(19) NOT NULL,
  `product_id` int(19) NOT NULL,
  `price` int(19) NOT NULL,
  `stocks` int(19) NOT NULL,
  `picture` varchar(255) NOT NULL,
  `created_at` datetime NOT NULL,
  `color_id` int(19) NOT NULL,
  `size_id` int(19) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `product_name`
--

CREATE TABLE `product_name` (
  `sid` int(19) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `description` varchar(255) NOT NULL,
  `category_id` int(19) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `product_name`
--

INSERT INTO `product_name` (`sid`, `product_name`, `description`, `category_id`) VALUES
(95, '男款透氣快乾跑步背心RUNDRY', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 4),
(96, '男款初階健身背心', '主要布料 100% 聚酯纖維', 4),
(97, '超輕量成人排汗籃球背心B300', '主要布料100%聚酯纖維', 4),
(98, '男款中階純棉運動背心', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 4),
(99, '【出清】中階成人籃球印花背心', '主要布料100%聚酯纖維', 4),
(100, '男款自行車透氣排汗無袖內衣', '主要布料100%聚酯纖維', 4),
(101, '男款防風跑步連帽背心外套RUNWIND', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 4),
(102, '男款健身背心', '主要布料100%聚酯纖維', 4),
(103, '拳擊連帽背心', '主要布料 100% 聚酯纖維', 4),
(104, '健身背心Stringer', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 4),
(105, '男款透氣輕盈跑步背心', '主要布料 100% 聚酯纖維', 4),
(106, '男款籃球雙面背心', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 4),
(107, '男款健身連帽背心', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 4),
(108, '男款籃球背心,上衣/NBA快艇隊', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 4),
(109, '男款登山健行保暖刷毛背心', '鞋底 50%乙烯醋酸乙烯共聚物EVA,50%乾天然橡膠鞋面100%聚酯纖維內底鞋墊100%聚酯纖維', 4),
(110, '男款登山健行多口袋快乾背心', '主要布料 100% 聚酯纖維', 4),
(111, '男款輕量自行車防風背心', '主要布料 100% 聚酯纖維', 4),
(112, '男款輕量保暖高爾夫羽絨背心', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 4),
(113, '男款籃球背心/NBA湖人隊', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 4),
(114, '男款彈性棉質背心', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 4),
(115, '耐磨輕量釣魚背心', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 4),
(116, '男款高階羽球吸濕排汗無袖上衣', '主要布料100%聚酯纖維塗層100%聚氨酯纖維', 4),
(117, '男款防潑水馬術背心', '鞋底70%乙烯醋酸乙烯共聚物EVA,30% 橡膠-再生手套鞋面95%聚酯纖維,5%熱塑性聚氨酯內底鞋墊100%聚酯纖維', 4),
(118, '男款籃球背心,上衣/NBA塞爾提克隊', '主要布料100%聚酯纖維拼接面料100%聚酯纖維', 4);

-- --------------------------------------------------------

--
-- 資料表結構 `product_size`
--

CREATE TABLE `product_size` (
  `sid` int(19) NOT NULL,
  `size` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `product_size`
--

INSERT INTO `product_size` (`sid`, `size`) VALUES
(5, '2XL'),
(6, '3XL'),
(3, 'L'),
(2, 'M'),
(1, 'S'),
(4, 'XL');

-- --------------------------------------------------------

--
-- 替換檢視表以便查看 `test`
-- (請參考以下實際畫面)
--
CREATE TABLE `test` (
`sid` int(19)
,`product_name` varchar(255)
,`color_name` varchar(255)
,`size` varchar(255)
);

-- --------------------------------------------------------

--
-- 檢視表結構 `test`
--
DROP TABLE IF EXISTS `test`;

CREATE ALGORITHM=UNDEFINED DEFINER=`lin`@`%` SQL SECURITY DEFINER VIEW `test`  AS SELECT `pd`.`sid` AS `sid`, `pn`.`product_name` AS `product_name`, `pc`.`color_name` AS `color_name`, `ps`.`size` AS `size` FROM ((((`product_detail` `pd` join `product_color` `pc`) join `product_name` `pn`) join `product_size` `ps`) join `product_categories` `pcat`) WHERE ((`pd`.`product_id` = `pn`.`sid`) AND (`pd`.`color_id` = `pc`.`sid`) AND (`pd`.`size_id` = `ps`.`sid`))  ;

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `equipment_color`
--
ALTER TABLE `equipment_color`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `equipment_detail`
--
ALTER TABLE `equipment_detail`
  ADD PRIMARY KEY (`sid`),
  ADD UNIQUE KEY `equipment_id` (`equipment_id`,`size_id`,`color_id`),
  ADD KEY `color_id` (`color_id`),
  ADD KEY `size_id` (`size_id`);

--
-- 資料表索引 `equipment_name`
--
ALTER TABLE `equipment_name`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `equipment_size`
--
ALTER TABLE `equipment_size`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `product_categories`
--
ALTER TABLE `product_categories`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `product_color`
--
ALTER TABLE `product_color`
  ADD PRIMARY KEY (`sid`),
  ADD UNIQUE KEY `color_name` (`color_name`);

--
-- 資料表索引 `product_detail`
--
ALTER TABLE `product_detail`
  ADD PRIMARY KEY (`sid`),
  ADD UNIQUE KEY `sid` (`sid`,`price`,`product_id`),
  ADD KEY `color_id` (`color_id`),
  ADD KEY `product_id` (`product_id`),
  ADD KEY `size_id` (`size_id`);

--
-- 資料表索引 `product_name`
--
ALTER TABLE `product_name`
  ADD PRIMARY KEY (`sid`),
  ADD UNIQUE KEY `product_name` (`product_name`),
  ADD KEY `category_id` (`category_id`);

--
-- 資料表索引 `product_size`
--
ALTER TABLE `product_size`
  ADD PRIMARY KEY (`sid`),
  ADD UNIQUE KEY `product_size` (`size`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `equipment_color`
--
ALTER TABLE `equipment_color`
  MODIFY `sid` int(19) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `equipment_detail`
--
ALTER TABLE `equipment_detail`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `equipment_name`
--
ALTER TABLE `equipment_name`
  MODIFY `sid` int(19) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=204;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `equipment_size`
--
ALTER TABLE `equipment_size`
  MODIFY `sid` int(19) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_categories`
--
ALTER TABLE `product_categories`
  MODIFY `sid` int(19) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_color`
--
ALTER TABLE `product_color`
  MODIFY `sid` int(19) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_detail`
--
ALTER TABLE `product_detail`
  MODIFY `sid` int(19) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_name`
--
ALTER TABLE `product_name`
  MODIFY `sid` int(19) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=120;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_size`
--
ALTER TABLE `product_size`
  MODIFY `sid` int(19) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 已傾印資料表的限制式
--

--
-- 資料表的限制式 `equipment_detail`
--
ALTER TABLE `equipment_detail`
  ADD CONSTRAINT `equipment_detail_ibfk_1` FOREIGN KEY (`color_id`) REFERENCES `equipment_color` (`sid`),
  ADD CONSTRAINT `equipment_detail_ibfk_2` FOREIGN KEY (`size_id`) REFERENCES `equipment_size` (`sid`),
  ADD CONSTRAINT `equipment_detail_ibfk_3` FOREIGN KEY (`equipment_id`) REFERENCES `equipment_name` (`sid`);

--
-- 資料表的限制式 `product_detail`
--
ALTER TABLE `product_detail`
  ADD CONSTRAINT `product_detail_ibfk_1` FOREIGN KEY (`color_id`) REFERENCES `product_color` (`sid`),
  ADD CONSTRAINT `product_detail_ibfk_2` FOREIGN KEY (`product_id`) REFERENCES `product_name` (`sid`),
  ADD CONSTRAINT `product_detail_ibfk_4` FOREIGN KEY (`size_id`) REFERENCES `product_size` (`sid`);

--
-- 資料表的限制式 `product_name`
--
ALTER TABLE `product_name`
  ADD CONSTRAINT `product_name_ibfk_1` FOREIGN KEY (`category_id`) REFERENCES `product_categories` (`sid`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
